gicking/STM8_headers/SVD/STM8L151C4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <baseAddress>0x50E0</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>3</size>
        <usage>registers</usage>
      </addressBlock>
      <description>IWDG</description>
      <groupName>Watchdog</groupName>
      <registers>
        <register>
          <name>KR</name>
          <description>IWDG key register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>KEY0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEY7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>IWDG prescaler register</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <description>IWDG reload register</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OPT</name>
      <baseAddress>0x4800</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0002</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0008</offset>
        <size>5</size>
        <usage>registers</usage>
      </addressBlock>
      <description>OPT</description>
      <groupName>Option-Bytes</groupName>
      <registers>
        <register>
          <name>OPT0</name>
          <description>Read-out protection (ROP)</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xAA</resetValue>
        </register>
        <register>
          <name>OPT1</name>
          <description>User boot code (UBC)</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT3</name>
          <description>Watchdog option</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT4</name>
          <description>Clock option</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT5</name>
          <description>Brownout reset (BOR)</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPTBL_H</name>
          <description>Bootloader (high byte)</description>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPTBL_L</name>
          <description>Bootloader (low byte)</description>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <baseAddress>0x50B2</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <description>PWR</description>
      <groupName>PWR</groupName>
      <registers>
        <register>
          <name>CSR1</name>
          <description>Power control and status register 1</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PVDE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PVDIEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDIF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDOF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR2</name>
          <description>Power control and status register 2</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>VREFINTF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ULP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWU</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
